#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```terraform
aws_elastic_beanstalk_application.task_listing_app: Refreshing state... [id=patsy-task-listing-app]
aws_iam_role.elastic_beanstalk_ec2_role: Refreshing state... [id=patsy-elastic-beanstalk-ec2-role]
aws_ecr_repository.task_listing_app: Refreshing state... [id=task-listing-app]
aws_s3_bucket.dockerrun_bucket: Refreshing state... [id=patsy-task-app-dockerrun-bucket]
aws_iam_role_policy_attachment.eb_ecr_access: Refreshing state... [id=patsy-elastic-beanstalk-ec2-role-20250409110604312000000002]
aws_iam_role_policy_attachment.eb_cloudwatch_logs_access: Refreshing state... [id=patsy-elastic-beanstalk-ec2-role-20250409125641080100000001]
aws_iam_role_policy_attachment.eb_web_tier: Refreshing state... [id=patsy-elastic-beanstalk-ec2-role-20250409110604306600000001]
aws_iam_role_policy_attachment.eb_worker_tier: Refreshing state... [id=patsy-elastic-beanstalk-ec2-role-20250409110604312500000003]
aws_iam_role_policy_attachment.eb_multicontainer_docker: Refreshing state... [id=patsy-elastic-beanstalk-ec2-role-20250409125641099900000002]
aws_iam_instance_profile.elastic_beanstalk_ec2_instance_profile: Refreshing state... [id=patsy-elastic-beanstalk-ec2-instance-profile]
aws_elastic_beanstalk_environment.task_listing_app_environment: Refreshing state... [id=e-kdvrswf3pu]
aws_s3_bucket_versioning.dockerrun_versioning: Refreshing state... [id=patsy-task-app-dockerrun-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.rds_app will be created
  + resource "aws_db_instance" "rds_app" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "patsy-task-app-database"
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "patsy-task-app"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "root"
      + vpc_security_group_ids                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>